programming/arch-setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-01 Sat 11:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="eo shiru" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7cf425f">1. Internet connection</a>
<ul>
<li><a href="#orgd08dfd4">1.1. Eduroam</a></li>
</ul>
</li>
<li><a href="#org986736a">2. Window manager</a></li>
<li><a href="#org3dada23">3. Dotfiles</a></li>
<li><a href="#org89c7fea">4. Package manager</a></li>
<li><a href="#orgeb4f749">5. Packages</a>
<ul>
<li><a href="#org76efb30">5.1. Essential packages</a></li>
<li><a href="#org3640dc0">5.2. Setup (neo)vim</a></li>
<li><a href="#org407e94f">5.3. File Manager</a></li>
<li><a href="#org82de67d">5.4. Emacs</a></li>
<li><a href="#orga6cb8f7">5.5. VS Code</a></li>
<li><a href="#org99906a1">5.6. Blogging</a></li>
<li><a href="#org85e16bf">5.7. Password management</a></li>
<li><a href="#orgb4725a8">5.8. Reference managment</a></li>
<li><a href="#orgaecedb6">5.9. Window compositor</a></li>
<li><a href="#org3fd94cb">5.10. Video Player</a></li>
<li><a href="#orga9dcdcd">5.11. Screenshots</a></li>
<li><a href="#orge50fbad">5.12. Document Viewer</a></li>
<li><a href="#org9d3f760">5.13. Ebook Management</a></li>
<li><a href="#org621a374">5.14. Calculator</a></li>
<li><a href="#orgbcde969">5.15. IRC</a></li>
<li><a href="#org6ad700e">5.16. VPN (Uni etc)</a></li>
<li><a href="#org8115b94">5.17. Heroku</a></li>
<li><a href="#orgd7b9d69">5.18. Torrent</a></li>
<li><a href="#org6739dfb">5.19. Database GUI</a></li>
</ul>
</li>
<li><a href="#org3a0d636">6. Homefolder structure</a></li>
<li><a href="#org19d2fc8">7. Programming</a>
<ul>
<li><a href="#orgff22b26">7.1. General</a></li>
<li><a href="#org72dc0a6">7.2. C/C++</a>
<ul>
<li><a href="#orgd593498">7.2.1. Compilations</a></li>
</ul>
</li>
<li><a href="#org706effe">7.3. Javascript</a></li>
<li><a href="#org18eb993">7.4. Go</a></li>
<li><a href="#orga3abb4b">7.5. C#</a></li>
<li><a href="#org7790237">7.6. Ruby</a>
<ul>
<li><a href="#orga651ce6">7.6.1. Ruby Gems</a></li>
<li><a href="#org0303525">7.6.2. Rails</a></li>
</ul>
</li>
<li><a href="#orgb49ee36">7.7. Postgres</a></li>
<li><a href="#orge314b64">7.8. Other</a>
<ul>
<li><a href="#orgc65b92f">7.8.1. HTTP Rest Client</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org29bdb22">8. Tips &amp; Tricks</a>
<ul>
<li><a href="#org3fe3bf9">8.1. Use more cores for compiling packages (mkkpkg)</a></li>
<li><a href="#org1b1b6fd">8.2. Sort/update pacman mirrors</a></li>
<li><a href="#orgdad5505">8.3. Maintenance</a></li>
<li><a href="#org148b0b4">8.4. Primer on zshell files</a></li>
<li><a href="#org2bacc47">8.5. Ingoring aliases</a></li>
<li><a href="#org389a9bd">8.6. Updating and upgrading</a></li>
<li><a href="#orgef8ecd5">8.7. Configure touchpad</a></li>
<li><a href="#orgacdc9f6">8.8. SSH</a></li>
<li><a href="#org1fd5b63">8.9. GPG</a></li>
<li><a href="#org84880cf">8.10. Services</a></li>
<li><a href="#org4f4d34b">8.11. Formatting and mounting of external drives</a></li>
<li><a href="#org943ee42">8.12. Mount Android device</a></li>
<li><a href="#org5f1530f">8.13. Changing "os name"</a></li>
<li><a href="#orgb35c417">8.14. Touchpad</a></li>
<li><a href="#org543797a">8.15. Source of an alias</a></li>
<li><a href="#org0e56f3a">8.16. Change folder permission from root to user</a></li>
<li><a href="#org0ad4b7e">8.17. Writing .iso to usb</a></li>
<li><a href="#org106d5be">8.18. Bluetooth</a></li>
<li><a href="#org686bc8b">8.19. Synchronizing Files/Folders</a>
<ul>
<li><a href="#orga97b566">8.19.1. Sync/Backup Commands</a></li>
</ul>
</li>
<li><a href="#orgcb8b558">8.20. Youtube-DL</a></li>
<li><a href="#org69676e7">8.21. System Time</a></li>
<li><a href="#org3271ced">8.22. Screenlock</a></li>
<li><a href="#org0f1597a">8.23. List files and copy</a></li>
<li><a href="#orgc3a79fb">8.24. Find and delete duplicates</a></li>
<li><a href="#orgf8bccc2">8.25. Recursively search &amp; replace in Emacs</a></li>
<li><a href="#org79748d2">8.26. Sync system clock time and date</a></li>
</ul>
</li>
<li><a href="#org6ae2969">9. Current List of Installed Packages</a></li>
</ul>
</div>
</div>
<ol class="org-ol">
<li>Use something like archifi, architect or anarchy linux (arch installer) to get up running quickly. The steps I've written down and that always worked as well as what is in the arch wiki didn't work the last time I tried on my laptop that's why I resorted to an installer. Usually I prefer to do everything myself but I didn't succeed and had no time left so I went with anarchy-linux as an installer, that is pretty vanilla anyway. They have different options, I went with the one for 'advanced users' which gave me the most customizability (basically everything I cared for anyway was configurable through this).</li>
</ol>

<div id="outline-container-org7cf425f" class="outline-2">
<h2 id="org7cf425f"><span class="section-number-2">1</span> Internet connection</h2>
<div class="outline-text-2" id="text-1">
<p>
It is important to have an working internet connection. This is easily achieved by opening an Wi-Fi hotspot from phone (Tethering) and connecting via <code>wpa_supplicant -B -i {interfaceName} -c &lt;(wpa_passphrase '{SSID}' {passphrase})</code>. The interface can be recieved via <code>ifconfig</code> or <code>ip link</code>. Full example command: <code>wpa_supplicant -B -i wlp3s0 -c &lt;(wpa_passphrase 'Y6 Max' a1b2d3)</code>. However using my phone's wifi hotspot was/is incredibly slow so that wasnt/isnt really practical. It is enough to use <code>curl</code> for a small file, as needed in the following section!
</p>
</div>
<div id="outline-container-orgd08dfd4" class="outline-3">
<h3 id="orgd08dfd4"><span class="section-number-3">1.1</span> Eduroam</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Because I don't have my own internet access and have to rely on the university's internet access via eduroam - things of course have to be more complicated. Quickest solution that I found was uploading an <code>.tar</code> archive that contains the targeted <code>wpa_supplicant.conf</code> (without the passphrase/identity ofc) and the required certificate (e.g <code>ca.pem</code>) to transfer.sh (awesome service!) from another, already setup machine.
</p>

<p>
On the target device now boot the iso via usb and <code>curl -O https://transfer.sh/xyz/abc.tar</code>, extract the archive via <code>tar -xf abc.tar</code> and edit the <code>wpa_supplicant.conf</code> with e.g nano to include the passphrase/identity as well as the path to the certificate.
</p>

<p>
Then run <code>wpa_supplicant -i {interfaceName} -c {path/to/wpa_supplicant.conf}</code>, in my case that was <code>wpa_supplicant -i wlp3s0 -c /root/eduroam-config/wpa_supplicant.conf</code>. If everything goes well the connection will now be established. In my case after <code>CTRL-EVENT-CONNECTED</code> showed up I knew it worked, however I didn't get back to the prompt and it stayed as is. I thought the best idea is to <code>ctrl-z</code>, but as it turns out that suspends the process and the connection will be gone. I thought that this puts the process in background :D. It would probably have been possible to detach from the process via <code>&amp;</code> but I didnt test that because I ended up just running <code>wpa_supplicant</code> on the 1st virtual console and switching to another virtual console (tty2) via <code>Ctrl-Alt-F2</code>. Okay now we're set (<code>ping google.com</code> to verify)!
</p>

<p>
Another problem that occured was fixed by searching for the pid of <code>wpa_supplicant</code> (was running from teathering with phone )with <code>top</code> and killing it before runnig wpa<sub>supplicant</sub> withthe configuration file. If that doesnt help to kill a connection thats already in place, set the interface down and up with <code>ip link set wlp3s0 down</code>. If already on the installed system use <code>sudo</code>!
</p>

<p>
Alternatively use <code>nmcli device wifi connect &lt;SSID&gt; password &lt;passphrase&gt;</code> (or <code>wifi-menu</code>) when the system is installed because Internet again is required to first obtain dotfiles and then packages.
</p>

<p>
With <code>nm-applet</code> connecting to wifis is relatively easy, however it is buggy with for example eduroam. A workaround is to click <code>connect to hidden wifi</code> and enter the ssid as well the rest manually. Also make sure that if using <code>NetworkManager</code> that the <code>dhcpcd</code> service is not running / enabled on default (check the Services section in the Tips &amp; Tricks part).
</p>

<p>
The connection config files are usually in <code>/etc/NetworkManager/system-connections</code> (may need to <code>su</code> first).
</p>
</div>
</div>
</div>


<div id="outline-container-org986736a" class="outline-2">
<h2 id="org986736a"><span class="section-number-2">2</span> Window manager</h2>
<div class="outline-text-2" id="text-2">
<p>
Update: Now using <code>awesome</code>. Install <code>awesome-freedesktop</code> and <code>lain</code> as well (additionally roboto font too).
<del>The anarchy installer allowed me to install my window manager of choice - <code>bswpm</code> - already. It also installed <code>sxhkd</code> which is used as a hotkey daemon to setup keyboard shortcuts.</del>
<del>Also install awesome-revelation-git which is awesome (lel) for switching between clients.</del> (&rarr; not as useful as I thought)
</p>
</div>
</div>
