programming/arch-setup.html



<div id="outline-container-org3dada23" class="outline-2">
<h2 id="org3dada23"><span class="section-number-2">3</span> Dotfiles</h2>
<div class="outline-text-2" id="text-3">
<p>
Now I'd need my dotfiles. But the most important thing first <code>sudo pacman -S git</code>. 
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/schoettkr/dotfiles.git ~/dotfiles <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">might want to checkout a specific branch!</span>
sudo pacman -S stow

<span style="color: #d33682; font-style: italic;">cd</span> dotfiles <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">you need to be in the dotfiles directory</span>


stow -v -t ~/.config config <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">with '-t' the target dir can be set explicitly</span>

mkdir ~/.fonts
stow -v -t ~/.fonts fonts

stow -v git

stow -v scripts

stow -v X

git clone https://github.com/robbyrussell/oh-my-zsh.git ~/.oh-my-zsh <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">if not already installed</span>
stow -v zsh
</pre>
</div>
<p>
You also want to setup github auth (to not be prompted by magit everytime for example). Do the following
</p>
<div class="org-src-container">
<pre class="src src-sh">git config --global --add github.user &lt;user&gt;
git config --global --add github.oauth-token &lt;token&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-org89c7fea" class="outline-2">
<h2 id="org89c7fea"><span class="section-number-2">4</span> Package manager</h2>
<div class="outline-text-2" id="text-4">
<p>
Setup home folder structure first or atleast have <code>~/arch/pkgs/</code> in place to then
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">Also check sometimes that "yay" is still developed and the most common/best package manger :)</span>
git clone https://aur.archlinux.org/yay.git ~/arch/pkgs 
<span style="color: #d33682; font-style: italic;">cd</span> arch/pkgs/yay
makepkg -si
</pre>
</div>
</div>
</div>


<div id="outline-container-orgeb4f749" class="outline-2">
<h2 id="orgeb4f749"><span class="section-number-2">5</span> Packages</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org76efb30" class="outline-3">
<h3 id="org76efb30"><span class="section-number-3">5.1</span> Essential packages</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-bash">yay -S polybar termite feh google-chrome chromium redshift zsh-autosuggestions neovim rofi
</pre>
</div>
<p>
Tip: Use DuckDuckGoog as chrome search engine
</p>
</div>
</div>
<div id="outline-container-org3640dc0" class="outline-3">
<h3 id="org3640dc0"><span class="section-number-3">5.2</span> Setup (neo)vim</h3>
<div class="outline-text-3" id="text-5-2">
<p>
However that should be done via current line in my config, but nevertheless:
</p>
<div class="org-src-container">
<pre class="src src-bash">curl -fLo ~/.local/share/nvim/site/autoload/plug.vim --create-dirs <span style="color: #2aa198;">\</span>
    https://raw.githubusercontent.com/junegunn/vim-plug/master/plug.vim
</pre>
</div>
<p>
Then open nvim and run <code>:PlugInstall:</code>
</p>
</div>
</div>
<div id="outline-container-org407e94f" class="outline-3">
<h3 id="org407e94f"><span class="section-number-3">5.3</span> File Manager</h3>
<div class="outline-text-3" id="text-5-3">
<p>
I survive without a file manager but sometimes it's just nice to have one and manage some files via mouse. For this purpouse install
</p>
<div class="org-src-container">
<pre class="src src-sh">yay spacefm
</pre>
</div>
</div>
</div>
<div id="outline-container-org82de67d" class="outline-3">
<h3 id="org82de67d"><span class="section-number-3">5.4</span> Emacs</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #d33682; font-style: italic;">cd</span> ~
git clone https://github.com/schoettkr/Terra.git .emacs.d
yay -S emacs
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6cb8f7" class="outline-3">
<h3 id="orga6cb8f7"><span class="section-number-3">5.5</span> VS Code</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Install <code>yay -S code</code> and the extension "Settings Sync". Regenerate the github token and then copy the settings gist id so that the settings download.
</p>
</div>
</div>
<div id="outline-container-org99906a1" class="outline-3">
<h3 id="org99906a1"><span class="section-number-3">5.6</span> Blogging</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-bash">yay -S nikola texlive-core pygmentize
</pre>
</div>
</div>
</div>

<div id="outline-container-org85e16bf" class="outline-3">
<h3 id="org85e16bf"><span class="section-number-3">5.7</span> Password management</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Import the password file (library -&gt; docs -&gt; passwords.kdbx)
Use keepassxc <a href="https://github.com/keepassxreboot/keepassxc">https://github.com/keepassxreboot/keepassxc</a>
</p>
<pre class="example">
yay -S keepassxc
</pre>
</div>
</div>

<div id="outline-container-orgb4725a8" class="outline-3">
<h3 id="orgb4725a8"><span class="section-number-3">5.8</span> Reference managment</h3>
<div class="outline-text-3" id="text-5-8">
<p>
Use zotero (gtk2 application) because it has less dependencies than jabref and kbibtex
</p>
<div class="org-src-container">
<pre class="src src-bash">yay zotero
yay texlive-latexextra texlive-bibtexextra biber <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">for emacs org -&gt; pdf export support</span>
</pre>
</div>
<p>
Open zotero and go to <code>Edit -&gt; Preferences -&gt; Advanced -&gt; Files and Folders</code> and change the data directory location to keep your home directory clean (change to eg <code>~/arch/pkgs</code>)
Then install the <code>zotero-better-bibtex</code> addon. Instructions can be found here <a href="https://retorque.re/zotero-better-bibtex/installation/">https://retorque.re/zotero-better-bibtex/installation/</a>
</p>
</div>
</div>

<div id="outline-container-orgaecedb6" class="outline-3">
<h3 id="orgaecedb6"><span class="section-number-3">5.9</span> Window compositor</h3>
<div class="outline-text-3" id="text-5-9">
<div class="org-src-container">
<pre class="src src-bash">yay -S compton
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fd94cb" class="outline-3">
<h3 id="org3fd94cb"><span class="section-number-3">5.10</span> Video Player</h3>
<div class="outline-text-3" id="text-5-10">
<p>
Just install <code>mpv</code> no questions!!
To resume video playback run <code>echo "save-position-on-quit" &gt;&gt; ~/.config/mpv/mpv.conf</code>
</p>
</div>
</div>

<div id="outline-container-orga9dcdcd" class="outline-3">
<h3 id="orga9dcdcd"><span class="section-number-3">5.11</span> Screenshots</h3>
<div class="outline-text-3" id="text-5-11">
<p>
To take screenshots <code>scrot</code> is a nice minimal utility. Install it and use it as follows:
</p>
<ul class="org-ul">
<li><code>scrot -u [filename]</code> to take screenshot of currently focused window
<ul class="org-ul">
<li><code>scrot -u -d [num] [filename]</code> waits <code>num</code> seconds before taking the picture (defer)</li>
</ul></li>
<li><code>scrot -s [filename]</code> and click or draw a rectangle to capture the selection</li>
<li>other options:
<ul class="org-ul">
<li><code>-b</code> also grabs the window's border</li>
<li><code>-t</code> grabs a window and creates a thumbnail of it; This can be useful when you're posting screen captures online</li>
<li><code>-c</code> creates a countdown in your terminal when you use the -d option</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge50fbad" class="outline-3">
<h3 id="orge50fbad"><span class="section-number-3">5.12</span> Document Viewer</h3>
<div class="outline-text-3" id="text-5-12">
<pre class="example">
yay evince-light
</pre>
</div>
</div>
<div id="outline-container-org9d3f760" class="outline-3">
<h3 id="org9d3f760"><span class="section-number-3">5.13</span> Ebook Management</h3>
<div class="outline-text-3" id="text-5-13">
<p>
Update: Actually I don't like calibre and it does not seem to be worth it for me. Just put your pdfs/mobis/azws in library/books. Convert pdf documents with <code>k2pdfopt</code> and html files with <a href="https://ebook.online-convert.com/convert-to-mobi">https://ebook.online-convert.com/convert-to-mobi</a>. That's it not much hassle. To put files onto your ebook reader just mount it and cp as you'd do for any other device - this is the method of least hassle.
</p>

<p>
Make sure to have the homefolder structure in place. Books are supposed to go into <code>~/library/books/Calibre</code>. Install <code>calibre</code> and set it up in accordance to this guide <a href="https://www.reddit.com/r/kindle/comments/3b7dzl/tutorial_how_to_use_calibre_to_manage_book/">https://www.reddit.com/r/kindle/comments/3b7dzl/tutorial_how_to_use_calibre_to_manage_book/</a>
Copy of the guide (as of 20.11.2018):
</p>
</div>
<ol class="org-ol">
