programming/arch-setup.html
<li><a id="org20e2e78"></a>Le Guide<br />
<div class="outline-text-5" id="text-5-13-0-1">
<p>
Setting up Calibre using Welcome Wizard:
</p>

<p>
Create a new empty folder using your library's desired name
</p>

<p>
Launch Calibre and choose that folder.
</p>

<p>
Next, Choose your device. If you choose Kindle, go to step 4. If you choose other e-readers, go to step 6. If you don't want to set up Send-to-Kindle, go to step 6.
</p>

<p>
Go to Amazon's Manage Your Content and Devices, choose Settings, find Personal Document Settings. Take note of the Send-to-Kindle E-Mail (ending with @Kindle,com). Find Add a new approved e-mail address and type in your GMX email.
</p>

<p>
In the Next dialog on Calibre welcome wizard, type in your Kindle email. Press Use GMX and type in your GMX credentials.
</p>

<p>
Next, and you are done.
</p>

<p>
.
</p>

<p>
Setting up your Calibre:
</p>

<p>
Select Preferences
</p>

<p>
Choose Behavior, set Preferred output format to AZW3 (if you're using Kindle) or EPUB (if you're using other devices). The reason is that AZW3 and EPUB can make use of Calibre's Edit Book function. Apply.
</p>

<p>
Choose Add your own columns, press the "+" button. Setup the following:
</p>

<p>
Pages (For Count Pages plugin, to get page number on your books):
</p>

<p>
Lookup name: pages
</p>

<p>
Column heading: Pages
</p>

<p>
Column type: Integers.
</p>

<p>
Format for numbers: {0,}
</p>

<p>
Shelf (To manage your reading progress):
</p>

<p>
Lookup name: shelf
</p>

<p>
Column heading: Shelf
</p>

<p>
Column type: Text, column shown in the tag browser.
</p>

<p>
Choose Common Options, Look &amp; Feel, set Embed font famlly to your preferred font. I choose Bookerly here. Note: I have no problem using Bookerly on the Kindle 7th Gen, but for the older generations, there might be some issues. The font will be in the Publisher's Font option on the Kindle.
</p>

<p>
Choose Saving books to disk, Copy and paste the following to the Save template: 1. Books/{author<sub>sort</sub>}/{title}/{title} - {authors}
</p>

<p>
Choose Sending books to devices, Copy and paste the following to the Save template: 1. Books/{author<sub>sort</sub>}/{title}/{title} - {authors}
</p>

<p>
Choose Metadata plugboards, Add new plugboard
</p>

<p>
Format: any format
</p>

<p>
Device: any device
</p>

<p>
Source template: {series:|| - }{series<sub>index</sub>:0&gt;5.2f|[|] - }{title}
</p>

<p>
This will save your books like this: Harry Potter - [01.00] - Harry Potter and the Sorcerer's Stone if your book is in a series, or Oliver Twist if your book isn't.
</p>

<p>
You can look here for more options
</p>

<p>
Destination field: title
</p>

<p>
Choose Plugins, find Kindle 2/3/4/Touch/PaperWhite/Voyage Device Interface, set:
</p>

<p>
Save templates: 1. Books/{author<sub>sort</sub>}/{title}/{title} - {authors}
</p>

<p>
Custom column name to retrieve page counts from: #pages
</p>

<p>
Disable Overwrite existing apnx on device
</p>

<p>
Close, and restart Calibre
</p>

<p>
.
</p>

<p>
Adding plug-ins to power-up your Calibre:
</p>

<p>
Select Preferences, choose Plugins
</p>

<p>
Choose Get new plugins
</p>

<p>
Find and install Goodreads and Count Pages
</p>

<p>
Find Count Pages plugin, double click, under Page count options, choose Custom column: #pages. Leave the others blank.
</p>

<p>
Notes: This only gives you a rough estimation of the books. If you want a more accurate version, use Amazon books, or use the built-in Download page counts from Goodreads
</p>

<p>
Apply.
</p>

<p>
Go to Metadata download, and choose Goodreads
</p>

<p>
Apply, and Restart Calibre.
</p>

<p>
.
</p>

<p>
Using Calibre to manage books:
</p>

<p>
Add books: You can Drag-and-drop the ebook files to Calibre, or use the Add books function.
</p>

<p>
Edit metadata: You can type in your books' metadata manually, or download the data using Download metadata buttons. Calibre will automatically search book's data and you can choose the matching title.
</p>

<p>
Convert books: When sending to Kindle, Calibre'll automatically convert your books to Kindle readable formats, but it won't store the file locally. You can convert individually, or bulk convert to save the metadata directly to your books
</p>

<p>
If you connect Kindle to Calibre, Calibre will automatically find books on your Kindle. To send books to your Kindle, press Send to device.
</p>

<p>
Fetch news: You can choose your favorite news source from the menu, Press Schedule for download, choose days to download, and Save. Calibre will automatically download News IF IT IS RUNNING and send to your Kindle if you already set up Send-to-Kindle account.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org621a374" class="outline-3">
<h3 id="org621a374"><span class="section-number-3">5.14</span> Calculator</h3>
<div class="outline-text-3" id="text-5-14">
<p>
Install <code>speedcrunch</code>
</p>
</div>
</div>

<div id="outline-container-orgbcde969" class="outline-3">
<h3 id="orgbcde969"><span class="section-number-3">5.15</span> IRC</h3>
<div class="outline-text-3" id="text-5-15">
<p>
Maybe get into <code>weechat</code> sometime but for now <code>hexchat</code> seems to be the sanest/simplest client :)
</p>
</div>
</div>

<div id="outline-container-org6ad700e" class="outline-3">
<h3 id="org6ad700e"><span class="section-number-3">5.16</span> VPN (Uni etc)</h3>
<div class="outline-text-3" id="text-5-16">
<p>
Install <code>openconnect</code> and connect for example like this:
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo openconnect https://vpn-server.uni-hannover.de/
</pre>
</div>
<p>
And then enter credentials when prompted.
</p>
</div>
</div>

<div id="outline-container-org8115b94" class="outline-3">
<h3 id="org8115b94"><span class="section-number-3">5.17</span> Heroku</h3>
<div class="outline-text-3" id="text-5-17">
<p>
Install the <code>heroku-cli</code>. Use <code>heroku git:remote -a REMOTE-REPO-NAME</code> to add heroku remote to an existing project.
</p>
</div>
</div>

<div id="outline-container-orgd7b9d69" class="outline-3">
<h3 id="orgd7b9d69"><span class="section-number-3">5.18</span> Torrent</h3>
<div class="outline-text-3" id="text-5-18">
<p>
Use the <code>transmission-gui</code>
</p>
</div>
</div>

<div id="outline-container-org6739dfb" class="outline-3">
<h3 id="org6739dfb"><span class="section-number-3">5.19</span> Database GUI</h3>
<div class="outline-text-3" id="text-5-19">
<ul class="org-ul">
<li>SQL: Dbeaver</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org3a0d636" class="outline-2">
<h2 id="org3a0d636"><span class="section-number-2">6</span> Homefolder structure</h2>
<div class="outline-text-2" id="text-6">
<p>
Create the following folder structure in the home directory:
</p>
<pre class="example">
~/arch
~/dls
~/dev
~/library

~/library/books

~/library/docs
;;~/library/docs/misc

~/library/music

~/library/images
~/library/images/wallpaper
~/library/images/personal

~/library/videos
~/library/videos/personal
~/library/videos/courses

~/misc

~/temp
;; ~/docs/coding
;; ~/docs/life
</pre>

<p>
To get rid of the folders that are create by default edit (or via dotfiles) <code>~/.config/user-dirs.dirs</code> to the wanted structure and then remove them.
Then run <code>xdg-user-dirs-update</code>. (PS do not <i>remove</i> <code>xdg_desktop_dir</code> &lt;- read this on the internetz but check what really happens!).
</p>
</div>
</div>




<div id="outline-container-org19d2fc8" class="outline-2">
<h2 id="org19d2fc8"><span class="section-number-2">7</span> Programming</h2>
<div class="outline-text-2" id="text-7">
<p>
Stuff that is specific to programming / development
</p>
</div>
<div id="outline-container-orgff22b26" class="outline-3">
<h3 id="orgff22b26"><span class="section-number-3">7.1</span> General</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Might consider ripgrep tho
</p>
<div class="org-src-container">
<pre class="src src-bash">yay the_silver_searcher <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">this is ag</span>
</pre>
</div>
</div>
</div>
