programming/arch-setup.org
** C/C++
Install the Clang compiler which is a compiler/frontend for C family languages based on LLVM:
#+BEGIN_SRC bash
yay -S clang
#+END_SRC

Update: Install =ccls= instead!
+Install cquery which is needed for emacs-cquery and lsp mode+
#+BEGIN_SRC bash
yay -S cquery
#+END_SRC

Install gdb (GNU debugger that can be used for many languages_
#+BEGIN_SRC bash
yay gdb
#+END_SRC
In Emacs gdb debug mode use OR use =nemiver= or =ddd= or someother graphical debugger:
- =break LL= to set breakpoint
- =delete XY= to delete breakpoint
- =run= to start the program
- =print XY= to print once
- =display XY= to print repeatedly automatic
- =print *(Student *)0x55555556b6b0= eg to print value at memory address 0x55555556b6b0 as a Student
- =x/12xb m->data= eg to examine memory of int array data and show the first 3 ints stored there / 12 bytes (3 integers a 4 bytes = 12)

See here for more on gdb http://kirste.userpage.fu-berlin.de/chemnet/use/info/gdb/gdb_9.html

*** Compilations
Assembly file:
#+BEGIN_SRC sh
g++ -S Math.cpp
#+END_SRC

Preprocessed file without linking:
#+BEGIN_SRC sh
g++ Math.cpp -c -E -P -o Math.cc
#+END_SRC

Compile without linking:
#+BEGIN_SRC sh
g++ -g Math.cpp -o Math -c
#+END_SRC

Compile and link:
#+BEGIN_SRC sh
g++ -g Math.cpp -o Math
#+END_SRC

** Javascript
Install the node version manager to manage different nodejs versions:
#+BEGIN_SRC bash
yay -S nvm
#+END_SRC
Then run the following if it isn't already present in =.zshrc=
#+BEGIN_SRC bash
echo 'source /usr/share/nvm/init-nvm.sh' >> ~/.zshrc
#+END_SRC
Note: having the above command in =.zshrc= slows down the prompt when opening a terminal immensely. You might want to have this line commented out when not working with js/node :)
If you want to execute node binaries also comment in the part where the node binaries are added to PATH.
Restart the shell and start installing node versions via:
#+BEGIN_SRC bash
nvm install 11 # current version at time of writing this!
#+END_SRC

** Go
Go projects will live in a specific folder (ususally =~/go=). I set this to =~/dev/go/= so make sure that folder exists (and verify that gopath is still set to that in =~/.zshrc=). Install:
#+BEGIN_SRC sh
yay go go-tools
#+END_SRC
Also "$GOPATH/bin" needs to be appended to the "$PATH" variable to be able to execute the Go binaries (eg godef). This should also be reflected in =~/.zshrc=.

Then install the needed dev tools, currently:
#+BEGIN_SRC sh
go get -u github.com/rogpeppe/godef/...
go get -u github.com/nsf/gocode
go get -u golang.org/x/tools/cmd/goimports
go get -u github.com/dougm/goflymake
go get -u golang.org/x/tools/cmd/guru
#+END_SRC

** C#
Install the dotnet sdk either from the aur or via the official site. Preferably do it via the official site because last time I installed it from AUR there were problems when running C# debugger

Link: https://www.microsoft.com/net/download or rather -> https://www.microsoft.com/net/download/thank-you/dotnet-sdk-2.1.403-linux-x64-binaries to install from source and not via some package managers
#+BEGIN_SRC sh
yay dotnet-sdk # from aur NOT recommended
#+END_SRC
And then comment in the relevant parts in .zshrc:
#+BEGIN_SRC sh
export DOTNET_ROOT=$HOME/arch/pkgs/dotnet 
export PATH=$PATH:$HOME/arch/pkgs/dotnet
#+END_SRC
In emacs run =omnisharp-install-server=.

** Ruby
Install =rbenv= to manage ruby versions.
#+BEGIN_SRC sh
yay rbenv
yay ruby-build # needed to install & compile ruby versions
#+END_SRC
Install a ruby version e.g version =2.6.1= (check which is the most current version beforehand)
#+BEGIN_SRC sh
rbenv install 2.6.1
#+END_SRC
Set the installed version to be the global default
#+BEGIN_SRC sh
rbenv global 2.6.1
#+END_SRC
Update the environment in accordance to the config
#+BEGIN_SRC sh
rbenv rehash
#+END_SRC
Verify the ruby version and also make sure that =eval "$(rbenv init -)"= is present in =.zshrc= for this to work:
#+BEGIN_SRC sh
ruby -v # => 2.6.1
which ruby
#+END_SRC
*** Ruby Gems
Some useful ruby gems to install globally:
#+BEGIN_SRC sh
gem install bundler pry pry-doc byebug
#+END_SRC
*** Rails
#+BEGIN_SRC sh
gem install rails
which rails
#+END_SRC

** Postgres
#+BEGIN_SRC sh
yay postgresql
sudo -u postgres -i initdb --locale $LANG -E UTF8 -D /var/lib/postgres/data
sudo systemctl start postgresql.service
sudo systemctl enable postgresql.service
sudo -u postgres -i
psql # might not work yet
#+END_SRC
When in postgres shell you can:
#+BEGIN_SRC sh
createuser --interactive -P
#+END_SRC
And/or create database
#+BEGIN_SRC sh
createdb -O octoprint octoprint_filamentmanager
# or
createdb bank 
# in the shell to create a db with the name "bank"
# you can then connect to the db via 
psql -U postgres bank # "postgres" is username you coulve used "eoshiru" or left it off altogether
#+END_SRC
Running =psql= works in psql-shell (after =sudo -u postgres -i=):
#+BEGIN_SRC sh
psql
\conninfo # for connection information
#+END_SRC
See these links when encountering problems:
- https://github.com/malnvenshorn/OctoPrint-FilamentManager/wiki/Setup-PostgreSQL-on-Arch-Linux
- https://help.ubuntu.com/community/PostgreSQL
  
Then may want to install =sqlite= (or =postico= on mac)

** Other
