programming/arch-setup.html
<div id="outline-container-org72dc0a6" class="outline-3">
<h3 id="org72dc0a6"><span class="section-number-3">7.2</span> C/C++</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Install the Clang compiler which is a compiler/frontend for C family languages based on LLVM:
</p>
<div class="org-src-container">
<pre class="src src-bash">yay -S clang
</pre>
</div>

<p>
Update: Install <code>ccls</code> instead!
<del>Install cquery which is needed for emacs-cquery and lsp mode</del>
</p>
<div class="org-src-container">
<pre class="src src-bash">yay -S cquery
</pre>
</div>

<p>
Install gdb (GNU debugger that can be used for many languages_
</p>
<div class="org-src-container">
<pre class="src src-bash">yay gdb
</pre>
</div>
<p>
In Emacs gdb debug mode use OR use <code>nemiver</code> or <code>ddd</code> or someother graphical debugger:
</p>
<ul class="org-ul">
<li><code>break LL</code> to set breakpoint</li>
<li><code>delete XY</code> to delete breakpoint</li>
<li><code>run</code> to start the program</li>
<li><code>print XY</code> to print once</li>
<li><code>display XY</code> to print repeatedly automatic</li>
<li><code>print *(Student *)0x55555556b6b0</code> eg to print value at memory address 0x55555556b6b0 as a Student</li>
<li><code>x/12xb m-&gt;data</code> eg to examine memory of int array data and show the first 3 ints stored there / 12 bytes (3 integers a 4 bytes = 12)</li>
</ul>

<p>
See here for more on gdb <a href="http://kirste.userpage.fu-berlin.de/chemnet/use/info/gdb/gdb_9.html">http://kirste.userpage.fu-berlin.de/chemnet/use/info/gdb/gdb_9.html</a>
</p>
</div>

<div id="outline-container-orgd593498" class="outline-4">
<h4 id="orgd593498"><span class="section-number-4">7.2.1</span> Compilations</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
Assembly file:
</p>
<div class="org-src-container">
<pre class="src src-sh">g++ -S Math.cpp
</pre>
</div>

<p>
Preprocessed file without linking:
</p>
<div class="org-src-container">
<pre class="src src-sh">g++ Math.cpp -c -E -P -o Math.cc
</pre>
</div>

<p>
Compile without linking:
</p>
<div class="org-src-container">
<pre class="src src-sh">g++ -g Math.cpp -o Math -c
</pre>
</div>

<p>
Compile and link:
</p>
<div class="org-src-container">
<pre class="src src-sh">g++ -g Math.cpp -o Math
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org706effe" class="outline-3">
<h3 id="org706effe"><span class="section-number-3">7.3</span> Javascript</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Install the node version manager to manage different nodejs versions:
</p>
<div class="org-src-container">
<pre class="src src-bash">yay -S nvm
</pre>
</div>
<p>
Then run the following if it isn't already present in <code>.zshrc</code>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #d33682; font-style: italic;">echo</span> <span style="color: #2aa198;">'source /usr/share/nvm/init-nvm.sh'</span> &gt;&gt; ~/.zshrc
</pre>
</div>
<p>
Note: having the above command in <code>.zshrc</code> slows down the prompt when opening a terminal immensely. You might want to have this line commented out when not working with js/node :)
If you want to execute node binaries also comment in the part where the node binaries are added to PATH.
Restart the shell and start installing node versions via:
</p>
<div class="org-src-container">
<pre class="src src-bash">nvm install 11 <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">current version at time of writing this!</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org18eb993" class="outline-3">
<h3 id="org18eb993"><span class="section-number-3">7.4</span> Go</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Go projects will live in a specific folder (ususally <code>~/go</code>). I set this to <code>~/dev/go/</code> so make sure that folder exists (and verify that gopath is still set to that in <code>~/.zshrc</code>). Install:
</p>
<div class="org-src-container">
<pre class="src src-sh">yay go go-tools
</pre>
</div>
<p>
Also "$GOPATH/bin" needs to be appended to the "$PATH" variable to be able to execute the Go binaries (eg godef). This should also be reflected in <code>~/.zshrc</code>.
</p>

<p>
Then install the needed dev tools, currently:
</p>
<div class="org-src-container">
<pre class="src src-sh">go get -u github.com/rogpeppe/godef/...
go get -u github.com/nsf/gocode
go get -u golang.org/x/tools/cmd/goimports
go get -u github.com/dougm/goflymake
go get -u golang.org/x/tools/cmd/guru
</pre>
</div>
</div>
</div>

<div id="outline-container-orga3abb4b" class="outline-3">
<h3 id="orga3abb4b"><span class="section-number-3">7.5</span> C#</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Install the dotnet sdk either from the aur or via the official site. Preferably do it via the official site because last time I installed it from AUR there were problems when running C# debugger
</p>

<p>
Link: <a href="https://www.microsoft.com/net/download">https://www.microsoft.com/net/download</a> or rather -&gt; <a href="https://www.microsoft.com/net/download/thank-you/dotnet-sdk-2.1.403-linux-x64-binaries">https://www.microsoft.com/net/download/thank-you/dotnet-sdk-2.1.403-linux-x64-binaries</a> to install from source and not via some package managers
</p>
<div class="org-src-container">
<pre class="src src-sh">yay dotnet-sdk <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">from aur NOT recommended</span>
</pre>
</div>
<p>
And then comment in the relevant parts in .zshrc:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d33682; font-style: italic;">export</span> <span style="color: #268bd2;">DOTNET_ROOT</span>=$<span style="color: #268bd2;">HOME</span>/arch/pkgs/dotnet 
<span style="color: #d33682; font-style: italic;">export</span> <span style="color: #268bd2;">PATH</span>=$<span style="color: #268bd2;">PATH</span>:$<span style="color: #268bd2;">HOME</span>/arch/pkgs/dotnet
</pre>
</div>
<p>
In emacs run <code>omnisharp-install-server</code>.
</p>
</div>
</div>

<div id="outline-container-org7790237" class="outline-3">
<h3 id="org7790237"><span class="section-number-3">7.6</span> Ruby</h3>
<div class="outline-text-3" id="text-7-6">
<p>
Install <code>rbenv</code> to manage ruby versions.
</p>
<div class="org-src-container">
<pre class="src src-sh">yay rbenv
yay ruby-build <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">needed to install &amp; compile ruby versions</span>
</pre>
</div>
<p>
Install a ruby version e.g version <code>2.6.1</code> (check which is the most current version beforehand)
</p>
<div class="org-src-container">
<pre class="src src-sh">rbenv install 2.6.1
</pre>
</div>
<p>
Set the installed version to be the global default
</p>
<div class="org-src-container">
<pre class="src src-sh">rbenv global 2.6.1
</pre>
</div>
<p>
Update the environment in accordance to the config
</p>
<div class="org-src-container">
<pre class="src src-sh">rbenv rehash
</pre>
</div>
<p>
Verify the ruby version and also make sure that <code>eval "$(rbenv init -)"</code> is present in <code>.zshrc</code> for this to work:
</p>
<div class="org-src-container">
<pre class="src src-sh">ruby -v <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">=&gt; 2.6.1</span>
<span style="color: #d33682; font-style: italic;">which</span> ruby
</pre>
</div>
</div>
<div id="outline-container-orga651ce6" class="outline-4">
<h4 id="orga651ce6"><span class="section-number-4">7.6.1</span> Ruby Gems</h4>
<div class="outline-text-4" id="text-7-6-1">
<p>
Some useful ruby gems to install globally:
</p>
<div class="org-src-container">
<pre class="src src-sh">gem install bundler pry pry-doc byebug
</pre>
</div>
</div>
</div>
<div id="outline-container-org0303525" class="outline-4">
<h4 id="org0303525"><span class="section-number-4">7.6.2</span> Rails</h4>
<div class="outline-text-4" id="text-7-6-2">
<div class="org-src-container">
<pre class="src src-sh">gem install rails
<span style="color: #d33682; font-style: italic;">which</span> rails
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb49ee36" class="outline-3">
<h3 id="orgb49ee36"><span class="section-number-3">7.7</span> Postgres</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">
<pre class="src src-sh">yay postgresql
sudo -u postgres -i initdb --locale $<span style="color: #268bd2;">LANG</span> -E UTF8 -D /var/lib/postgres/data
sudo systemctl start postgresql.service
sudo systemctl enable postgresql.service
sudo -u postgres -i
psql <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">might not work yet</span>
</pre>
</div>
<p>
When in postgres shell you can:
</p>
<div class="org-src-container">
<pre class="src src-sh">createuser --interactive -P
</pre>
</div>
<p>
And/or create database
</p>
<div class="org-src-container">
<pre class="src src-sh">createdb -O octoprint octoprint_filamentmanager
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">or</span>
createdb bank 
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">in the shell to create a db with the name "bank"</span>
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">you can then connect to the db via </span>
psql -U postgres bank <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">"postgres" is username you coulve used "eoshiru" or left it off altogether</span>
</pre>
</div>
<p>
Running <code>psql</code> works in psql-shell (after <code>sudo -u postgres -i</code>):
</p>
<div class="org-src-container">
<pre class="src src-sh">psql
\conninfo <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">for connection information</span>
</pre>
</div>
<p>
See these links when encountering problems:
</p>
<ul class="org-ul">
<li><a href="https://github.com/malnvenshorn/OctoPrint-FilamentManager/wiki/Setup-PostgreSQL-on-Arch-Linux">https://github.com/malnvenshorn/OctoPrint-FilamentManager/wiki/Setup-PostgreSQL-on-Arch-Linux</a></li>
<li><a href="https://help.ubuntu.com/community/PostgreSQL">https://help.ubuntu.com/community/PostgreSQL</a></li>
</ul>

<p>
Then may want to install <code>sqlite</code> (or <code>postico</code> on mac)
</p>
</div>
</div>
