programming/arch-setup.org
*** HTTP Rest Client
Use insomnia which can be installed through snap.


* Tips & Tricks
** Use more cores for compiling packages (mkkpkg)
In =/etc/makepkg.conf= change ~MAKEFLAGS="-jX"~ where =X= is the number of cores e.g =2=.

** Sort/update pacman mirrors
** Maintenance
#+BEGIN_SRC sh
sudo rm -rf /var/cache/pacman/pkg/*
sudo rm -rf /var/cache/man/*
ncdu -x / # Use as root to see where space is taken.
pacman -Qdt # to see orphan packages
systemctl --failed # check for failed systemd services
#+END_SRC
To monitor processes, cpu, memory etc install =glances=.
** Primer on zshell files
Since =.zshenv= is always sourced, it often contains exported variables that should be available to other programs. For example, $PATH, $EDITOR, and $PAGER are often set in .zshenv. Also, you can set $ZDOTDIR in .zshenv to specify an alternative location for the rest of your zsh configuration.

=.zshrc= is for interactive shell configuration. You set options for the interactive shell there with the setopt and unsetopt commands. You can also load shell modules, set your history options, change your prompt, set up zle and completion, et cetera. You also set any variables that are only used in the interactive shell (e.g. $LS_COLORS).

=.zlogin= is sourced on the start of a login shell. This file is often used to start X using startx. Some systems start X on boot, so this file is not always very useful.

=.zprofile= is basically the same as .zlogin except that it's sourced directly before .zshrc is sourced instead of directly after it. According to the zsh documentation, ".zprofile is meant as an alternative to `.zlogin' for ksh fans; the two are not intended to be used together, although this could certainly be done if desired."

=.zlogout= is sometimes used to clear and reset the terminal.
** Ignoring aliases
To execute a command that is shadowed by an alias prefix it with an backslash, e.g `\vim`
** SSH
Check for existing ssh keys:
#+BEGIN_SRC bash
ls -al ~/.ssh
#+END_SRC
Generate new ssh key:
#+BEGIN_SRC bash
# make sure that openssh is installed
yay -S openssh

ssh-keygen -t rsa -b 4096 -C "email@example.com"
#+END_SRC
Adding the ssh key to the ssh-agent:
#+BEGIN_SRC bash
eval "$(ssh-agent -s)" # start ssh-agent in background
ssh-add ~/.ssh/id_rsa # this needs to be the private not the public key file
#+END_SRC
** GPG
List keys:
#+BEGIN_SRC bash
gpg --list-keys
gpg --list-secret-keys
#+END_SRC
Export the private and public key:
#+BEGIN_SRC bash
gpg --export ${ID} > public.key
gpg --export-secret-keys ${ID} > private.key
#+END_SRC

To import the keys on for example another machine:
#+BEGIN_SRC bash
gpg --import public.key
gpg --import private.key
#+END_SRC

And trust the key(s) via:
#+BEGIN_SRC bash
gpg --edit-key ${ID}
trust
#+END_SRC

Then decrypt the files from the command line:
#+BEGIN_SRC bash
gpg -d file.gpg
#+END_SRC
** Services
List automatically started services:
#+BEGIN_SRC bash
systemctl list-unit-files --state=enabled
#+END_SRC

Check the status of an service:
#+BEGIN_SRC bash
systemctl status application.service
#+END_SRC

Start service in/for current session:
#+BEGIN_SRC bash
sudo systemctl start application.service
#+END_SRC

Stop service in/for current session:
#+BEGIN_SRC bash
sudo systemctl stop application.service
#+END_SRC

To enable an service to be started automatically on boot:
#+BEGIN_SRC bash
sudo systemctl enable application.service
#+END_SRC

To disable an automatically started service:
#+BEGIN_SRC bash
sudo systemctl disable application.service
#+END_SRC
** Formatting and mounting of external drives
First install =ntfs-3g= because by default only reading not writing is supported for ntfs partition.
** Mount Android device
Install =simple-mtpfs= and run =simple-mtpfs --device 1 ~/mnt= (maybe after restart). Then in file manager (eg =spacefm=) navigate to =mtp://=.
- Note: the folder =~/mnt= needs to exist before!
- to unmount run =fusermount -u ~/mnt=
** Changing "os name"
Edit =/etc/os-release= to e.g:
#+BEGIN_SRC 
NAME="Arch Linux"
ID=arch
PRETTY_NAME="Arch Linux"
ANSI_COLOR="0;36"
HOME_URL="https://www.archlinux.org/"
SUPPORT_URL="https://bbs.archlinux.org/"
BUG_REPORT_URL="https://bugs.archlinux.org/"
#+END_SRC
** Touchpad
If installed remove synaptic because its development is discontinued. Use libinput instead. To find out which drivers are currently used enter =grep -e "Using input" .local/share/xorg/Xorg.0.log=
#+BEGIN_SRC bash
xinput list # to list devices, search for eg 'touchpad' in the output. the number is the id
xinput list-props 11 # when 11 is the id
#+END_SRC
Put for example this in =/etc/X11/xorg.conf.d/30-touchpad.conf=:
#+BEGIN_SRC 
Section "InputClass"
        Identifier "libinput touchpad catchall"
        MatchIsTouchpad "on"
        MatchDevicePath "/dev/input/event*"
        Driver "libinput"
	Option "Tapping" "on"
	Option "AccelSpeed" "0.5"
EndSection
#+END_SRC
** Source of an alias
To find out what a command is aliased to enter =type {command}=, e.g =type l=
