programming/arch-setup.html

<div id="outline-container-orge314b64" class="outline-3">
<h3 id="orge314b64"><span class="section-number-3">7.8</span> Other</h3>
<div class="outline-text-3" id="text-7-8">
</div>
<div id="outline-container-orgc65b92f" class="outline-4">
<h4 id="orgc65b92f"><span class="section-number-4">7.8.1</span> HTTP Rest Client</h4>
<div class="outline-text-4" id="text-7-8-1">
<p>
Use insomnia which can be installed through snap.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org29bdb22" class="outline-2">
<h2 id="org29bdb22"><span class="section-number-2">8</span> Tips &amp; Tricks</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org3fe3bf9" class="outline-3">
<h3 id="org3fe3bf9"><span class="section-number-3">8.1</span> Use more cores for compiling packages (mkkpkg)</h3>
<div class="outline-text-3" id="text-8-1">
<p>
In <code>/etc/makepkg.conf</code> change <code>MAKEFLAGS="-jX"</code> where <code>X</code> is the number of cores e.g <code>2</code>.
</p>
</div>
</div>

<div id="outline-container-org1b1b6fd" class="outline-3">
<h3 id="org1b1b6fd"><span class="section-number-3">8.2</span> Sort/update pacman mirrors</h3>
</div>
<div id="outline-container-orgdad5505" class="outline-3">
<h3 id="orgdad5505"><span class="section-number-3">8.3</span> Maintenance</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-sh">sudo rm -rf /var/cache/pacman/pkg/*
sudo rm -rf /var/cache/man/*
ncdu -x / <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">Use as root to see where space is taken.</span>
pacman -Qdt <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">to see orphan packages</span>
systemctl --failed <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">check for failed systemd services</span>
</pre>
</div>
<p>
To monitor processes, cpu, memory etc install <code>glances</code>.
</p>
</div>
</div>
<div id="outline-container-org148b0b4" class="outline-3">
<h3 id="org148b0b4"><span class="section-number-3">8.4</span> Primer on zshell files</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Since <code>.zshenv</code> is always sourced, it often contains exported variables that should be available to other programs. For example, $PATH, $EDITOR, and $PAGER are often set in .zshenv. Also, you can set $ZDOTDIR in .zshenv to specify an alternative location for the rest of your zsh configuration.
</p>

<p>
<code>.zshrc</code> is for interactive shell configuration. You set options for the interactive shell there with the setopt and unsetopt commands. You can also load shell modules, set your history options, change your prompt, set up zle and completion, et cetera. You also set any variables that are only used in the interactive shell (e.g. $LS<sub>COLORS</sub>).
</p>

<p>
<code>.zlogin</code> is sourced on the start of a login shell. This file is often used to start X using startx. Some systems start X on boot, so this file is not always very useful.
</p>

<p>
<code>.zprofile</code> is basically the same as .zlogin except that it's sourced directly before .zshrc is sourced instead of directly after it. According to the zsh documentation, ".zprofile is meant as an alternative to `.zlogin' for ksh fans; the two are not intended to be used together, although this could certainly be done if desired."
</p>

<p>
<code>.zlogout</code> is sometimes used to clear and reset the terminal.
</p>
</div>
</div>
<div id="outline-container-org2bacc47" class="outline-3">
<h3 id="org2bacc47"><span class="section-number-3">8.5</span> Ingoring aliases</h3>
<div class="outline-text-3" id="text-8-5">
<p>
To execute a command that is shadowed by an alias prefix it with an backslash, e.g `\vim`
</p>
</div>
</div>
<div id="outline-container-org389a9bd" class="outline-3">
<h3 id="org389a9bd"><span class="section-number-3">8.6</span> Updating and upgrading</h3>
</div>
<div id="outline-container-orgef8ecd5" class="outline-3">
<h3 id="orgef8ecd5"><span class="section-number-3">8.7</span> Configure touchpad</h3>
</div>
<div id="outline-container-orgacdc9f6" class="outline-3">
<h3 id="orgacdc9f6"><span class="section-number-3">8.8</span> SSH</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Check for existing ssh keys:
</p>
<div class="org-src-container">
<pre class="src src-bash">ls -al ~/.ssh
</pre>
</div>
<p>
Generate new ssh key:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">make sure that openssh is installed</span>
yay -S openssh

ssh-keygen -t rsa -b 4096 -C <span style="color: #2aa198;">"email@example.com"</span>
</pre>
</div>
<p>
Adding the ssh key to the ssh-agent:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #d33682; font-style: italic;">eval</span> <span style="color: #2aa198;">"$(ssh-agent -s)"</span> <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">start ssh-agent in background</span>
ssh-add ~/.ssh/id_rsa <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">this needs to be the private not the public key file</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1fd5b63" class="outline-3">
<h3 id="org1fd5b63"><span class="section-number-3">8.9</span> GPG</h3>
<div class="outline-text-3" id="text-8-9">
<p>
List keys:
</p>
<div class="org-src-container">
<pre class="src src-bash">gpg --list-keys
gpg --list-secret-keys
</pre>
</div>
<p>
Export the private and public key:
</p>
<div class="org-src-container">
<pre class="src src-bash">gpg --export $<span style="color: #268bd2;">{</span><span style="color: #268bd2;">ID</span><span style="color: #268bd2;">}</span> &gt; public.key
gpg --export-secret-keys $<span style="color: #268bd2;">{</span><span style="color: #268bd2;">ID</span><span style="color: #268bd2;">}</span> &gt; private.key
</pre>
</div>

<p>
To import the keys on for example another machine:
</p>
<div class="org-src-container">
<pre class="src src-bash">gpg --import public.key
gpg --import private.key
</pre>
</div>

<p>
And trust the key(s) via:
</p>
<div class="org-src-container">
<pre class="src src-bash">gpg --edit-key $<span style="color: #268bd2;">{</span><span style="color: #268bd2;">ID</span><span style="color: #268bd2;">}</span>
trust
</pre>
</div>

<p>
Then decrypt the files from the command line:
</p>
<div class="org-src-container">
<pre class="src src-bash">gpg -d file.gpg
</pre>
</div>
</div>
</div>
<div id="outline-container-org84880cf" class="outline-3">
<h3 id="org84880cf"><span class="section-number-3">8.10</span> Services</h3>
<div class="outline-text-3" id="text-8-10">
<p>
List automatically started services:
</p>
<div class="org-src-container">
<pre class="src src-bash">systemctl list-unit-files --state=enabled
</pre>
</div>

<p>
Check the status of an service:
</p>
<div class="org-src-container">
<pre class="src src-bash">systemctl status application.service
</pre>
</div>

<p>
Start service in/for current session:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo systemctl start application.service
</pre>
</div>

<p>
Stop service in/for current session:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo systemctl stop application.service
</pre>
</div>

<p>
To enable an service to be started automatically on boot:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo systemctl enable application.service
</pre>
</div>

<p>
To disable an automatically started service:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo systemctl disable application.service
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f4d34b" class="outline-3">
<h3 id="org4f4d34b"><span class="section-number-3">8.11</span> Formatting and mounting of external drives</h3>
<div class="outline-text-3" id="text-8-11">
<p>
First install <code>ntfs-3g</code> because by default only reading not writing is supported for ntfs partition.
</p>
</div>
</div>
<div id="outline-container-org943ee42" class="outline-3">
<h3 id="org943ee42"><span class="section-number-3">8.12</span> Mount Android device</h3>
<div class="outline-text-3" id="text-8-12">
<p>
Install <code>simple-mtpfs</code> and run <code>simple-mtpfs --device 1 ~/mnt</code> (maybe after restart). Then in file manager (eg <code>spacefm</code>) navigate to <code>mtp://</code>.
</p>
<ul class="org-ul">
<li>Note: the folder <code>~/mnt</code> needs to exist before!</li>
<li>to unmount run <code>fusermount -u ~/mnt</code></li>
</ul>
</div>
</div>
<div id="outline-container-org5f1530f" class="outline-3">
<h3 id="org5f1530f"><span class="section-number-3">8.13</span> Changing "os name"</h3>
<div class="outline-text-3" id="text-8-13">
<p>
Edit <code>/etc/os-release</code> to e.g:
</p>
<pre class="example">
NAME="Arch Linux"
ID=arch
PRETTY_NAME="Arch Linux"
ANSI_COLOR="0;36"
HOME_URL="https://www.archlinux.org/"
SUPPORT_URL="https://bbs.archlinux.org/"
BUG_REPORT_URL="https://bugs.archlinux.org/"
</pre>
</div>
</div>
<div id="outline-container-orgb35c417" class="outline-3">
<h3 id="orgb35c417"><span class="section-number-3">8.14</span> Touchpad</h3>
<div class="outline-text-3" id="text-8-14">
<p>
If installed remove synaptic because its development is discontinued. Use libinput instead. To find out which drivers are currently used enter <code>grep -e "Using input" .local/share/xorg/Xorg.0.log</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">xinput list <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">to list devices, search for eg 'touchpad' in the output. the number is the id</span>
xinput list-props 11 <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">when 11 is the id</span>
</pre>
</div>
<p>
Put for example this in <code>/etc/X11/xorg.conf.d/30-touchpad.conf</code>:
</p>
<pre class="example">
Section "InputClass"
        Identifier "libinput touchpad catchall"
        MatchIsTouchpad "on"
        MatchDevicePath "/dev/input/event*"
        Driver "libinput"
  Option "Tapping" "on"
  Option "AccelSpeed" "0.5"
EndSection
</pre>
</div>
</div>
<div id="outline-container-org543797a" class="outline-3">
<h3 id="org543797a"><span class="section-number-3">8.15</span> Source of an alias</h3>
<div class="outline-text-3" id="text-8-15">
<p>
To find out what a command is aliased to enter <code>type {command}</code>, e.g <code>type l</code>
</p>
</div>
</div>
