programming/arch-setup.org
** Change folder permission from root to user
=sudo chown -R eoshiru FOLDERNAME=
** Writing .iso to usb
Make sure the device/usb stick you want to write to is unmounted (=sudo umount /dev/sdb=) and then execute ~sudo dd if=file.iso of=/dev/sdb~.
** Bluetooth
Run bluetoothctl (be sure to have systemctl status bluetooth running or start it otherwise) 
- =show= lists devices
- =select= select bluetooth on machine via MAC (C0:18 )
- =agent on=
- =power on=
- =scan= 
- =connect= 1F:11
** Synchronizing Files/Folders
Install =rsync=. To synchronize a folder =src= to =dest= run:
#+BEGIN_SRC  bash
rsync -a {srcPath}/ {destPath}/
#+END_SRC
Dont forget the trailing slashes, else the first folder would be copied into the second!
If deletions should be synced as well specify =d= flag as well.
Usually the -t flag which is included in the -a flag syncs modification time as well, but in case it did not work try the following:
#+BEGIN_SRC bash
touch -m -r source/path/file dest/path/file
#+END_SRC
that reads the timestamp from /one file/ into another /file/. Look on google for automating this if needed or use a python script like
#+BEGIN_SRC python
#!/usr/bin/python

import os
import sys

for directory,subdirs,files in os.walk('.'):
    pathes=subdirs+files
    for path in pathes:
        fullpath=os.path.join(directory,path)
        target_path=os.path.join(sys.argv[1],fullpath)
        mtime=os.lstat(fullpath).st_mtime
        print('touching',target_path,':',)
        try:
            os.utime(target_path,(mtime,mtime))
            print('OK')
        except:
            print('FAILED')
#+END_SRC
which has to be run from the source folder and the destinaiton is the first argument like: =cd source; python ~/timescript.py dest/folder/=
*** Sync/Backup Commands
#+BEGIN_SRC sh
# Copy banking documents
rsync -a /home/eoshiru/library/docs/banking/ /run/media/eoshiru/Elements/library/docs/banking/
# Copy (misc) images
rsync -a /home/eoshiru/library/images/misc/ /run/media/eoshiru/Elements/library/images/misc/
# Copy (misc) videos
rsync -a /home/eoshiru/library/videos/misc/ /run/media/eoshiru/Elements/library/videos/misc/
# Copy (misc) audio
rsync -a /home/eoshiru/library/audio/misc/ /run/media/eoshiru/Elements/library/audio/misc/
# Copy not yet synced mp3's
rsync -a /home/eoshiru/Deezloader\ Music/mp3s/ /run/media/eoshiru/Elements/library/music/
#+END_SRC

** Youtube-DL
1. Check the formats
=youtube-dl -F "https://www.youtube.com/watch?v=9cnI05qQpdo"=

2. Get the timestamp from where the download should begin
- For example via "Copy video Video URL at current time" in YT


3. Execute
- =ffmpeg $(youtube-dl -g -f 22 'https://www.youtube.com/watch?v=kn_eCjXhWdo' | sed "s/.*/-ss 197 -i &/") -t 4 -c copy monte.mp4=
- where =22= is the format you want, =197= is the start second and =4= is the duration in second from the starting point onwards
  
To download the audio mp3 only run:
=youtube-dl --extract-audio --audio-format mp3 LINK=

** System Time
The correct way to do this would be by enabling ntpd.service via systemd.
pacman -Syu ntp Installed the required package
systemctl enable ntpd.service Enable it at boot so every time you boot the system the clock will be synchronized
systemctl start ntpd.service Start it immediately
One could also run ntpd -qg as root.
#+BEGIN_SRC sh
systemctl start ntpd.service
ntpd -qg
#+END_SRC
   
** Screenlock
Install xtrlock

** HTML to PDF
Use =wkhtmltopdf HTMLFILENAME PDFOUTPUTFILENAME= or use the browser's print feature
** List files and copy
To list files by modified date and copy them somewhere run:
#+BEGIN_SRC sh
cp -- `ls -tr --quoting-style={escape,shell,c}` DESTINATION_PATH
#+END_SRC
- =--= to =cp= signals that there are no more flags coming (from dashes in filename for example)
- =-tr= sorts by time and reverses
- =quoting-style= applies double quotes instead of single quoutes (required by cp command)

Edit: theoretically the above should work but it doesn't, this is what get's the job done:
#+BEGIN_SRC sh
ls --quoting-style={escape,shell,c} -tr . | xargs -I{} cp "{}" DESTINATION_PATH
#+END_SRC
(This is what I exactly ran from the folder with all the files I wanted:
#+BEGIN_SRC sh
ls --quoting-style={escape,shell,c} -tr | xargs -I{} cp "{}"/mnt/SandiskSD/music/
#+END_SRC
)
** Find and delete duplicates
To find duplicates
#+BEGIN_SRC 
fdupes .  
#+END_SRC
To delete duplicates
#+BEGIN_SRC sh
fdupes -d
#+END_SRC
To skip prompt add =-N= (dont do that)

** Recursively search & replace in Emacs
1. M-x find-name-dired: you will be prompted for a root directory and a filename pattern.
2. Press t to "toggle mark" for all files found.
3. Press Q for "Query-Replace in Files...": you will be prompted for query/substitution regexps.
4. Proceed as with query-replace-regexp: SPACE to replace and move to next match, n to skip a match, etc.
5. Press C-x s to save buffers. (You can then press y, n or ! to save all at once)


** Rip CDs
https://www.reddit.com/r/commandline/comments/d40cst/looking_for_cd_ripper_software/

