programming/arch-setup.html
<div id="outline-container-org0e56f3a" class="outline-3">
<h3 id="org0e56f3a"><span class="section-number-3">8.16</span> Change folder permission from root to user</h3>
<div class="outline-text-3" id="text-8-16">
<p>
<code>sudo chown -R eoshiru FOLDERNAME</code>
</p>
</div>
</div>
<div id="outline-container-org0ad4b7e" class="outline-3">
<h3 id="org0ad4b7e"><span class="section-number-3">8.17</span> Writing .iso to usb</h3>
<div class="outline-text-3" id="text-8-17">
<p>
Make sure the device/usb stick you want to write to is unmounted (<code>sudo umount /dev/sdb</code>) and then execute <code>sudo dd if=file.iso of=/dev/sdb</code>.
</p>
</div>
</div>
<div id="outline-container-org106d5be" class="outline-3">
<h3 id="org106d5be"><span class="section-number-3">8.18</span> Bluetooth</h3>
<div class="outline-text-3" id="text-8-18">
<p>
Run bluetoothctl (be sure to have systemctl status bluetooth running or start it otherwise) 
</p>
<ul class="org-ul">
<li><code>show</code> lists devices</li>
<li><code>select</code> select bluetooth on machine via MAC (C0:18 )</li>
<li><code>agent on</code></li>
<li><code>power on</code></li>
<li><code>scan</code></li>
<li><code>connect</code> 1F:11</li>
</ul>
</div>
</div>
<div id="outline-container-org686bc8b" class="outline-3">
<h3 id="org686bc8b"><span class="section-number-3">8.19</span> Synchronizing Files/Folders</h3>
<div class="outline-text-3" id="text-8-19">
<p>
Install <code>rsync</code>. To synchronize a folder <code>src</code> to <code>dest</code> run:
</p>
<div class="org-src-container">
<pre class="src src-bash">rsync -a <span style="color: #268bd2;">{</span>srcPath<span style="color: #268bd2;">}</span>/ <span style="color: #268bd2;">{</span>destPath<span style="color: #268bd2;">}</span>/
</pre>
</div>
<p>
Dont forget the trailing slashes, else the first folder would be copied into the second!
If deletions should be synced as well specify <code>d</code> flag as well.
Usually the -t flag which is included in the -a flag syncs modification time as well, but in case it did not work try the following:
</p>
<div class="org-src-container">
<pre class="src src-bash">touch -m -r source/path/file dest/path/file
</pre>
</div>
<p>
that reads the timestamp from <i>one file</i> into another <i>file</i>. Look on google for automating this if needed or use a python script like
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">!/usr/bin/python</span>

<span style="color: #859900;">import</span> os
<span style="color: #859900;">import</span> sys

<span style="color: #859900;">for</span> directory,subdirs,files <span style="color: #859900;">in</span> os.walk<span style="color: #268bd2;">(</span><span style="color: #2aa198;">'.'</span><span style="color: #268bd2;">)</span>:
    <span style="color: #268bd2;">pathes</span>=subdirs+files
    <span style="color: #859900;">for</span> path <span style="color: #859900;">in</span> pathes:
        <span style="color: #268bd2;">fullpath</span>=os.path.join<span style="color: #268bd2;">(</span>directory,path<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">target_path</span>=os.path.join<span style="color: #268bd2;">(</span>sys.argv<span style="color: #d33682;">[</span>1<span style="color: #d33682;">]</span>,fullpath<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">mtime</span>=os.lstat<span style="color: #268bd2;">(</span>fullpath<span style="color: #268bd2;">)</span>.st_mtime
        <span style="color: #859900;">print</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">'touching'</span>,target_path,<span style="color: #2aa198;">':'</span>,<span style="color: #268bd2;">)</span>
        <span style="color: #859900;">try</span>:
            os.utime<span style="color: #268bd2;">(</span>target_path,<span style="color: #d33682;">(</span>mtime,mtime<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
            <span style="color: #859900;">print</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">'OK'</span><span style="color: #268bd2;">)</span>
        <span style="color: #859900;">except</span>:
            <span style="color: #859900;">print</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">'FAILED'</span><span style="color: #268bd2;">)</span>
</pre>
</div>
<p>
which has to be run from the source folder and the destinaiton is the first argument like: <code>cd source; python ~/timescript.py dest/folder/</code>
</p>
</div>
<div id="outline-container-orga97b566" class="outline-4">
<h4 id="orga97b566"><span class="section-number-4">8.19.1</span> Sync/Backup Commands</h4>
<div class="outline-text-4" id="text-8-19-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">Copy banking documents</span>
rsync -a /home/eoshiru/library/docs/banking/ /run/media/eoshiru/Elements/library/docs/banking/

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcb8b558" class="outline-3">
<h3 id="orgcb8b558"><span class="section-number-3">8.20</span> Youtube-DL</h3>
<div class="outline-text-3" id="text-8-20">
<ol class="org-ol">
<li>Check the formats</li>
</ol>
<p>
<code>youtube-dl -F "https://www.youtube.com/watch?v=9cnI05qQpdo"</code>
</p>

<ol class="org-ol">
<li>Get the timestamp from where the download should begin</li>
<li>For example via "Copy video Video URL at current time" in YT</li>
</ol>


<ol class="org-ol">
<li>Execute</li>
<li><code>ffmpeg $(youtube-dl -g -f 22 'https://www.youtube.com/watch?v=kn_eCjXhWdo' | sed "s/.*/-ss 197 -i &amp;/") -t 4 -c copy monte.mp4</code></li>
<li>where <code>22</code> is the format you want, <code>197</code> is the start second and <code>4</code> is the duration in second from the starting point onwards</li>
</ol>

<p>
To download the audio mp3 only run:
<code>youtube-dl --extract-audio --audio-format mp3 LINK</code>
</p>
</div>
</div>

<div id="outline-container-org69676e7" class="outline-3">
<h3 id="org69676e7"><span class="section-number-3">8.21</span> System Time</h3>
<div class="outline-text-3" id="text-8-21">
<p>
The correct way to do this would be by enabling ntpd.service via systemd.
</p>

<p>
One could also run ntpd -qg as root.
</p>
</div>
</div>

<div id="outline-container-org3271ced" class="outline-3">
<h3 id="org3271ced"><span class="section-number-3">8.22</span> Screenlock</h3>
<div class="outline-text-3" id="text-8-22">
<p>
Install xtrlock
</p>
</div>
</div>

<div id="outline-container-org0f1597a" class="outline-3">
<h3 id="org0f1597a"><span class="section-number-3">8.23</span> List files and copy</h3>
<div class="outline-text-3" id="text-8-23">
<p>
To list files by modified date and copy them somewhere run:
</p>
<div class="org-src-container">
<pre class="src src-sh">cp -- <span style="color: #268bd2;">`ls -tr --quoting-style={escape,shell,c}`</span> DESTINATION_PATH
</pre>
</div>
<ul class="org-ul">
<li><code>--</code> to <code>cp</code> signals that there are no more flags coming (from dashes in filename for example)</li>
<li><code>-tr</code> sorts by time and reverses</li>
<li><code>quoting-style</code> applies double quotes instead of single quoutes (required by cp command)</li>
</ul>

<p>
Edit: theoretically the above should work but it doesn't, this is what get's the job done:
</p>
<div class="org-src-container">
<pre class="src src-sh">ls --quoting-style=<span style="color: #268bd2;">{</span>escape,shell,c<span style="color: #268bd2;">}</span> -tr . | xargs -I<span style="color: #268bd2;">{}</span> cp <span style="color: #2aa198;">"{}"</span> DESTINATION_PATH
</pre>
</div>
<p>
(This is what I exactly ran from the folder with all the files I wanted:
</p>
<div class="org-src-container">
<pre class="src src-sh">ls --quoting-style=<span style="color: #268bd2;">{</span>escape,shell,c<span style="color: #268bd2;">}</span> -tr | xargs -I<span style="color: #268bd2;">{}</span> cp <span style="color: #2aa198;">"{}"</span>/mnt/SandiskSD/music/
</pre>
</div>
<p>
)
</p>
</div>
</div>
<div id="outline-container-orgc3a79fb" class="outline-3">
<h3 id="orgc3a79fb"><span class="section-number-3">8.24</span> Find and delete duplicates</h3>
<div class="outline-text-3" id="text-8-24">
<p>
To find duplicates
</p>
<pre class="example">
fdupes .  
</pre>
<p>
To delete duplicates
</p>
<div class="org-src-container">
<pre class="src src-sh">fdupes -d
</pre>
</div>
<p>
To skip prompt add <code>-N</code> (dont do that)
</p>
</div>
</div>

<div id="outline-container-orgf8bccc2" class="outline-3">
<h3 id="orgf8bccc2"><span class="section-number-3">8.25</span> Recursively search &amp; replace in Emacs</h3>
<div class="outline-text-3" id="text-8-25">
<ol class="org-ol">
<li>M-x find-name-dired: you will be prompted for a root directory and a filename pattern.</li>
<li>Press t to "toggle mark" for all files found.</li>
<li>Press Q for "Query-Replace in Files&#x2026;": you will be prompted for query/substitution regexps.</li>
<li>Proceed as with query-replace-regexp: SPACE to replace and move to next match, n to skip a match, etc.</li>
<li>Press C-x s to save buffers. (You can then press y, n or ! to save all at once)</li>
</ol>
</div>
</div>
